#include<iostream>
using namespace std;

int main()

{

int i,m[]={0,1,2,3,4,5,6,7,8,9};

int *p=m+3;                              //      判断输出                实际输出

cout<<*p<<endl;                          //        3                        3

cout<<++*p<<endl;                        //        4                        4           //程序先取p的值 (m[3]=3)，然后使其自增，此时p返回的值为4

cout<<*p<<endl;                          //        4                        4

cout<<*++p<<endl;                        //        4                        4          // 指针向前移动至第五个数字m[4]=4,取值后输出

cout<<*p<<endl;                          //        4                        4

cout<<*p++<<endl;                        //        4                        4          // 令p自增到指向m[5]=5，但是取值返回自增前的值m[4]=4                                    *

cout<<*p<<endl;                          //        5                        5          // m[5]=5

cout<<(*p)++<<endl;                      //        5                        5          // 先取p指向的数值m[5]=5,再令这个数值自增，m[5]=6，但此句打印数据返回的是自增前的值       *

cout<<*p<<endl;                          //        6                        6          // m[5]=6

cout<<++*p++<<endl;                      //        7                        7          // 先令p自增到指向m[6]=6，但是取值返回自增前的值m[5]=6,再取其自增，得到7          *

cout<<*p<<endl;                          //        6                        6          // m[6]=6

cout<<(++*p)++<<endl;                    //        7                        7          // 先取p指向的实际数值m[6]=6，然后让其自增，此时p返回值7，打印出来，之后再令这个数值再自增 *

cout<<*p<<endl;                          //        8                        8

p+=2; cout<<*p<<endl;                    //        8                        8          // 指针向前移动2位，m[8]=8

p=&m[6];                                                                               // 指针p移动回到m[6]=8                                                                 

cout<<*p<<endl;                          //        8                        8

i=*p+4; cout<<i<<endl;                   //        12                       12         // 取 p指向的数值8，然后再运算8+4=12

i=*(p-=3); cout<<i<<endl;                //        4                        4          // 令p后退3位，回到m[3]=4

cout<<*p<<endl;                          //        4                        4

*(p++)=9;                                                                              // 为p指向的数据m[3]赋值9,然后让p自增

cout<<*p<<endl;                          //        4                        4          // 上述语句将指针向前移动至第五个数字m[4]=4

cout<<*(p+1)<<endl;                      //        7                        7          // 读取第六个数字m[5]=7

return 0;

}


